app/controllers/attendance_reports_controller.rb

  def index
    @batches = Batch.active
    @config = Configuration.find_by_config_key('StudentAttendanceType')
---
SELECT * FROM `configurations` WHERE (`configurations`.`config_key` = 'AvailableModules')

  def mode
    @batch = Batch.find params[:batch_id]
---
SELECT * FROM `batches` WHERE (`batches`.`id` = 1)

  def show
    @batch = Batch.find params[:batch_id]
    @start_date = @batch.start_date.to_date
    @end_date = Date.today.to_date

    @mode = params[:mode]
    @config = Configuration.find_by_config_key('StudentAttendanceType')
    unless @config.config_value == 'Daily'
      if @mode == 'Overall'
        @students = Student.find_all_by_batch_id(@batch.id)
        unless params[:subject_id] == '0'
          @subject = Subject.find params[:subject_id]
          @report = PeriodEntry.find_all_by_subject_id(@subject.id,  :conditions =>{:month_date => @start_date..@end_date})
        else
          @report = PeriodEntry.find_all_by_batch_id(@batch.id,  :conditions =>{:month_date => @start_date..@end_date})
---
SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
SELECT * FROM `configurations` WHERE (`configurations`.`config_key` = 'AvailableModules')
SELECT * FROM `students` WHERE (`students`.`batch_id` = 1)
SELECT * FROM `period_entries` WHERE (`period_entries`.`month_date` BETWEEN '2012-01-28' AND '2012-01-29') AND (`period_entries`.`batch_id` = 1)