app/controllers/attendances_controller.rb

SELECT * FROM `configurations` WHERE (`configurations`.`config_key` = 'AvailableModules')
---
  def index
    @batches = Batch.active
    @config = Configuration.find_by_config_key('StudentAttendanceType')

SELECT * FROM `configurations` WHERE (`configurations`.`config_key` = 'AvailableModules')
SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
SELECT * FROM `students` WHERE (`students`.`batch_id` = 1)
SELECT * FROM `period_entries` WHERE (`period_entries`.`month_date` BETWEEN '2012-01-01' AND '2012-01-31') AND (`period_entries`.`batch_id` = 1) ORDER BY month_date asc
---
  def show
    @config = Configuration.find_by_config_key('StudentAttendanceType')
    unless params[:next].nil?
      @today = params[:next].to_date
    else
      @today = Date.today
    end
    start_date = @today.beginning_of_month
    end_date = @today.end_of_month
    if @config.config_value == 'Daily'
      @batch = Batch.find(params[:batch_id])
      @students = Student.find_all_by_batch_id(@batch.id)
      @dates = PeriodEntry.find_all_by_batch_id(@batch.id, :conditions =>{:month_date => start_date..end_date}, :order=>'month_date asc')

SELECT * FROM `configurations` WHERE (`configurations`.`config_key` = 'AvailableModules')
SELECT * FROM `students` WHERE (`students`.`id` = 1)
---
  def new
    @config = Configuration.find_by_config_key('StudentAttendanceType')
    @absentee = Attendance.new
    @student = Student.find(params[:id2])

SELECT * FROM `students` WHERE (`students`.`id` = 1)
SELECT `attendances`.id FROM `attendances` WHERE (`attendances`.`student_id` = 1 AND `attendances`.period_table_entry_id = 1) LIMIT 1
SELECT * FROM `period_entries` WHERE (`period_entries`.`id` = 1) ORDER BY month_date asc
INSERT INTO `attendances` (`student_id`, `period_table_entry_id`, `afternoon`, `reason`, `forenoon`) VALUES(1, 1, 1, 'Present', 1)
SELECT * FROM `attendances` WHERE (`attendances`.`student_id` = 1 AND `attendances`.`period_table_entry_id` = 1) LIMIT 1
SELECT * FROM `students` WHERE (`students`.`batch_id` = 1)
---
  def create
    @absentee = Attendance.new(params[:attendance])
    @student = Student.find(params[:attendance][:student_id])
    @period_entry = PeriodEntry.find(params[:attendance][:period_table_entry_id],:order=>'month_date asc')
    respond_to do |format|
      if @absentee.save
        sms_setting = SmsSetting.new()
        if sms_setting.application_sms_active and @student.is_sms_enabled and sms_setting.attendance_sms_active
          recipients = []
          message = "#{@student.first_name} #{@student.last_name} #{t('flash_msg7')} #{@period_entry.month_date}"
          if sms_setting.student_sms_active
            recipients.push @student.phone2 unless @student.phone2.nil?
          end
          if sms_setting.parent_sms_active
            unless @student.immediate_contact_id.nil?
              guardian = Guardian.find(@student.immediate_contact_id)
              recipients.push guardian.mobile_phone unless guardian.mobile_phone.nil?
            end
          end
          unless recipients.empty?
            sms = SmsManager.new(message,recipients)
            sms.send_sms
          end
        end
        @batch = @student.batch
        @students = Student.find_all_by_batch_id(@batch.id)

SELECT * FROM `period_entries` WHERE (`period_entries`.`month_date` BETWEEN '2012-01-01' AND '2012-01-31') AND (`period_entries`.`batch_id` = 1) ORDER BY month_date ASC
---
        end
        start_date = @today.beginning_of_month
        end_date = @today.end_of_month
        @dates = PeriodEntry.find_all_by_batch_id(@batch.id, :conditions =>{:month_date => start_date..end_date},:order=>'month_date ASC')

SELECT * FROM `configurations` WHERE (`configurations`.`config_key` = 'AvailableModules')
SELECT * FROM `attendances` WHERE (`attendances`.`id` = 1)
SELECT * FROM `students` WHERE (`students`.`id` = 1)
---
def edit
  @config = Configuration.find_by_config_key('StudentAttendanceType')
  @absentee = Attendance.find params[:id]
  @student = Student.find(@absentee.student_id)

SELECT * FROM `attendances` WHERE (`attendances`.`id` = 1)
DELETE FROM `attendances` WHERE (`id` IN (1))
SELECT * FROM `students` WHERE (`students`.`id` = 1)
SELECT * FROM `attendances` WHERE (`attendances`.`student_id` = 1 AND `attendances`.`period_table_entry_id` = 1) LIMIT 1
SELECT * FROM `period_entries` WHERE (`period_entries`.`id` = 1)
SELECT * FROM `students` WHERE (`students`.`batch_id` = 1)
SELECT * FROM `period_entries` WHERE (`period_entries`.`month_date` BETWEEN '2012-01-01' AND '2012-01-31') AND (`period_entries`.`batch_id` = 1) ORDER BY month_date ASC
---
def destroy
  @absentee = Attendance.find params[:id]
  @absentee.delete
  @student = Student.find(@absentee.student_id)
  @period_entry = PeriodEntry.find @absentee.period_table_entry_id
  respond_to do |format|
    @batch = @student.batch
    @students = Student.find_all_by_batch_id(@batch.id)
    unless params[:next].nil?
      @today = params[:next].to_date
    else
      @today = Date.today
    end
    start_date = @today.beginning_of_month
    end_date = @today.end_of_month
    @dates = PeriodEntry.find_all_by_batch_id(@batch.id, :conditions =>{:month_date => start_date..end_date},:order=>'month_date ASC')