app/controllers/batch_transfers_controller.rb

SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
SELECT * FROM `elective_groups` WHERE (`elective_groups`.batch_id = 1)
SELECT * FROM `subjects` WHERE (elective_group_id IS NOT NULL AND is_deleted = false) AND (`subjects`.`batch_id` = 1)
---
  def subject_transfer
    @batch = Batch.find(params[:id])
    @elective_groups = @batch.elective_groups
    @normal_subjects = @batch.normal_batch_subject
    @elective_subjects = Subject.find_all_by_batch_id(@batch.id,:conditions=>["elective_group_id IS NOT NULL AND is_deleted = false"])

SELECT * FROM `batches` WHERE (`batches`.course_id = 1)
SELECT * FROM `subjects` WHERE (elective_group_id IS NOT NULL AND is_deleted = false) AND (`subjects`.`batch_id` = 1)
SELECT count(*) AS count_all FROM `subjects` WHERE (`subjects`.batch_id = 1 AND (`subjects`.`is_deleted` = 0))
SELECT * FROM `elective_groups` WHERE (`elective_groups`.batch_id = 1)
---
  def get_previous_batch_subjects
    @batch = Batch.find(params[:id])
    course = @batch.course
    all_batches = course.batches(:order=>'id asc')
    all_batches.reject! {|b| b.is_deleted?}
    all_batches.reject! {|b| b.subjects.empty?}
    @previous_batch = all_batches[all_batches.size-2]
    unless @previous_batch.blank?
    @previous_batch_normal_subject = @previous_batch.normal_batch_subject
    @elective_groups = @previous_batch.elective_groups
    @previous_batch_electives = Subject.find_all_by_batch_id(@previous_batch.id,:conditions=>["elective_group_id IS NOT NULL AND is_deleted = false"])

SELECT * FROM `subjects` WHERE (`subjects`.`id` = 1)
SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
SELECT * FROM `subjects` WHERE (`subjects`.`is_deleted` = 0) AND (`subjects`.`batch_id` = 1 AND `subjects`.`name` = 'English') LIMIT 1
---
  def assign_previous_batch_subject
    subject = Subject.find(params[:id])
    batch = Batch.find(params[:id2])
    sub_exists = Subject.find_by_batch_id_and_name(batch.id,subject.name, :conditions => { :is_deleted => false})