app/controllers/batches_controller.rb

SELECT * FROM `batches` WHERE (`batches`.`id` = '1') LIMIT 1
SELECT * FROM `employee_departments` WHERE (`employee_departments`.`id` = 2)
---
  def assign_tutor
    @batch = Batch.find_by_id(params[:id])
    @assigned_employee = @batch.employee_id.split(",") unless @batch.employee_id.nil?
    @departments = EmployeeDepartment.find(:all)

SELECT * FROM `employees` WHERE (`employees`.`employee_department_id` = '2')
SELECT * FROM `batches` WHERE (`batches`.`id` = '1') LIMIT 1
---
  def update_employees
    @employees = Employee.find_all_by_employee_department_id(params[:department_id])
    @batch = Batch.find_by_id(params[:batch_id])

SELECT * FROM `batches` WHERE (`batches`.`id` = '1') LIMIT 1
SELECT * FROM `employees` WHERE (`employees`.`employee_department_id` = '2')
SELECT * FROM `employees` WHERE (`employees`.`id` = '2') LIMIT 1
UPDATE `batches` SET `employee_id` = '2' WHERE `id` = 1
---
  def assign_employee
    @batch = Batch.find_by_id(params[:batch_id])
    @employees = Employee.find_all_by_employee_department_id(params[:department_id])
    unless @batch.employee_id.blank?
      @assigned_emps = @batch.employee_id.split(',')
    else
      @assigned_emps = []
    end
    @assigned_emps.push(params[:id].to_s)

SELECT * FROM `batches` WHERE (`batches`.`id` = '1') LIMIT 1
SELECT * FROM `employees` WHERE (`employees`.`employee_department_id` = '2')
UPDATE `batches` SET `employee_id` = '3,6,1,7' WHERE `id` = 1
---
  def remove_employee
    @batch = Batch.find_by_id(params[:batch_id])
    @employees = Employee.find_all_by_employee_department_id(params[:department_id])
    @assigned_emps = @batch.employee_id.split(',')
    @removed_emps = @assigned_emps.delete(params[:id].to_s)
    @assigned_emps = @assigned_emps.join(",")
    @batch.update_attributes :employee_id =>@assigned_emps