app/controllers/calendar_controller.rb

SELECT * FROM `events` WHERE ((start_date >= '2012-01-01' and end_date <= '2012-01-31') or (start_date <= '2012-01-01' and end_date <= '2012-01-31') or (start_date>='2012-01-01' and end_date>='2012-01-31') or (start_date<='2012-01-01' and end_date>='2012-01-31') )
---
  def index
    @user = current_user
    if params[:new_month].nil?
      @show_month = Date.today
    else
      d = params[:new_month].to_i
      passed_date = (params[:passed_date]).to_date
      if params[:new_month].to_i > passed_date.month
        @show_month  = passed_date+1.month
      else
        @show_month = passed_date-1.month
      end
    end
    @start_date = @show_month.beginning_of_month
    @start_date_day = @start_date.wday
    @last_day = @show_month.end_of_month
    @notifications = Hash.new{|h,k| h[k]=Array.new}
    first_day = @show_month.beginning_of_month
    last_day =  @show_month.end_of_month
    @events = Event.find(:all,:conditions => ["(start_date >= ? and end_date <= ?) or (start_date <= ? and end_date <= ?)  or (start_date>=? and end_date>=?) or (start_date<=? and end_date>=?) ", first_day, last_day, first_day,last_day, first_day,last_day,first_day,last_day])

SELECT * FROM `events` WHERE ((start_date >= '2012-02-01' and end_date <= '2012-02-29') or (start_date <= '2012-02-01' and end_date <= '2012-02-29') or (start_date>='2012-02-01' and end_date>='2012-02-29') or (start_date<='2012-02-01' and end_date>='2012-02-29') )
---
  def new_calendar
    @user = current_user
    d = params[:new_month].to_i
    passed_date = (params[:passed_date]).to_date
    if params[:new_month].to_i > passed_date.month
      @show_month  = passed_date+1.month
    else
      @show_month = passed_date-1.month
    end
    @start_date = @show_month.beginning_of_month
    @start_date_day = @start_date.wday
    @last_day = @show_month.end_of_month
    @notifications = Hash.new{|h,k| h[k]=Array.new}
    first_day = @show_month.beginning_of_month
    last_day =  @show_month.end_of_month
    @events = Event.find(:all,:conditions => ["(start_date >= ? and end_date <= ?) or (start_date <= ? and end_date <= ?)  or (start_date>=? and end_date>=?) or (start_date<=? and end_date>=?) ", first_day, last_day, first_day,last_day, first_day,last_day,first_day,last_day])

SELECT * FROM `events` WHERE ((start_date >= '2012-02-01 00:00:00' and end_date <= '2012-02-29 00:00:00') or (start_date <= '2012-02-01 00:00:00' and end_date <= '2012-02-29 00:00:00') or (start_date>='2012-02-01 00:00:00' and end_date>='2012-02-29 00:00:00') or (start_date<='2012-02-01 00:00:00' and end_date>='2012-02-29 00:00:00') ) AND (`events`.`is_holiday` = 0 AND `events`.`is_common` = 1)
SELECT * FROM `events` WHERE ((start_date >= '2012-02-01 00:00:00' and end_date <= '2012-02-29 00:00:00') or (start_date <= '2012-02-01 00:00:00' and end_date <= '2012-02-29 00:00:00') or (start_date>='2012-02-01 00:00:00' and end_date>='2012-02-29 00:00:00') or (start_date<='2012-02-01 00:00:00' and end_date>='2012-02-29 00:00:00') ) AND (`events`.`is_holiday` = 0 AND `events`.`is_due` = 0 AND `events`.`is_common` = 0 AND `events`.`is_exam` = 0)
---
  def show_event_tooltip
    @user = current_user
    @date = params[:id].to_date
    first_day = @date.beginning_of_month.to_time
    last_day = @date.end_of_month.to_time

    common_event = Event.find_all_by_is_common_and_is_holiday(true,false, :conditions => ["(start_date >= ? and end_date <= ?) or (start_date <= ? and end_date <= ?)  or (start_date>=? and end_date>=?) or (start_date<=? and end_date>=?) ", first_day, last_day, first_day,last_day, first_day,last_day,first_day,last_day])
    non_common_events = Event.find_all_by_is_common_and_is_holiday_and_is_exam_and_is_due(false,false,false,false, :conditions => ["(start_date >= ? and end_date <= ?) or (start_date <= ? and end_date <= ?)  or (start_date>=? and end_date>=?) or (start_date<=? and end_date>=?) ", first_day, last_day, first_day,last_day, first_day,last_day,first_day,last_day])