app/controllers/class_timings_controller.rb

  def index
    @batches = Batch.active
    @class_timings = ClassTiming.find(:all,:conditions => { :batch_id => nil}, :order =>'start_time ASC')
---
SELECT * FROM `class_timings` WHERE (`class_timings`.`batch_id` IS NULL) ORDER BY start_time ASC

  def new
    @class_timing = ClassTiming.new
    @batch = Batch.find params[:id] if request.xhr? and params[:id]
---
SELECT * FROM `batches` WHERE (`batches`.`id` = 1)

  def create
    @class_timing = ClassTiming.new(params[:class_timing])
    @batch = @class_timing.batch
    respond_to do |format|
      if @class_timing.save
        @class_timing.batch.nil? ?
          @class_timings = ClassTiming.find(:all,:conditions => { :batch_id => nil}, :order =>'start_time ASC') :
---
INSERT INTO `class_timings` (`name`, `end_time`, `batch_id`, `start_time`, `is_break`) VALUES('Normal Day', '2012-01-29 19:00:00', 1, '2012-01-29 07:00:00', 0)
SELECT * FROM `class_timings` WHERE (start_time < '2012-01-29 07:00:00' and end_time > '2012-01-29 07:00:00' and batch_id =1) LIMIT 1

  def show
    @batch = nil
    if params[:batch_id] == ''
      @class_timings = ClassTiming.find(:all, :conditions=>["batch_id is null"])
    else
      @class_timings = ClassTiming.for_batch(params[:batch_id])
      @batch = Batch.find params[:batch_id] unless params[:batch_id] == ''
---
SELECT * FROM `batches` WHERE (`batches`.`id` = 1)