app/controllers/courses_controller.rb

  def update_batch
    @batch = Batch.find_all_by_course_id(params[:course_name], :conditions => { :is_deleted => false, :is_active => true })
---
SELECT * FROM `batches` WHERE (`batches`.`is_deleted` = 0 AND `batches`.`is_active` = 1) AND (`batches`.`course_id` = '1')

  def create
    @course = Course.new params[:course]
    if @course.save
---
INSERT INTO `courses` (`created_at`, `code`, `updated_at`, `course_name`, `is_deleted`, `section_name`) VALUES('2012-01-29 06:46:55', 'hbs/pgdm/01', '2012-01-29 06:46:55', 'PGDM ', 0, '2011-2013')

  def find_course
    @course = Course.find params[:id]
---
SELECT * FROM `courses` WHERE (`courses`.`id` = 1)