app/controllers/elective_groups_controller.rb

  def create
    @elective_group = ElectiveGroup.new(params[:elective_group])
    @elective_group.batch_id = @batch.id
    if @elective_group.save
---
INSERT INTO `elective_groups` (`name`, `created_at`, `updated_at`, `batch_id`, `is_deleted`) VALUES('Finance', '2012-01-29 06:59:50', '2012-01-29 06:59:50', 1, 0)