app/controllers/employee_attendance_controller.rb

  def leave_history
    @employee = Employee.find(params[:id])
---
SELECT * FROM `employees` WHERE (`employees`.user_id = 2) LIMIT 1

  def leaves
    @leave_types = EmployeeLeaveType.find(:all, :conditions=>"status = true")
    @employee = Employee.find(params[:id])
    @reporting_employees = Employee.find_all_by_reporting_manager_id(@employee.id)
---
SELECT * FROM `employee_leave_types` WHERE (status = true)
SELECT * FROM `employees` WHERE (`employees`.user_id = 2) LIMIT 1
SELECT * FROM `employees` WHERE (`employees`.`reporting_manager_id` = 2)