app/controllers/employee_controller.rb

SELECT * FROM `employee_categories` WHERE (status = true) ORDER BY name asc
SELECT * FROM `employee_grades` WHERE (status = true) ORDER BY name asc
SELECT * FROM `employee_departments` WHERE (status = true) ORDER BY name asc
SELECT * FROM `countries`
SELECT `employees`.id FROM `employees` WHERE (`employees`.`employee_number` = BINARY 'EMP6' AND `employees`.id <> 7) LIMIT 1
SELECT * FROM `configurations` WHERE (`configurations`.`config_key` = 'AvailableModules')
INSERT INTO `employees` (`employee_position_id`, `employee_grade_id`, `experience_year`, `experience_month`, `joining_date`, `home_state`, `created_at`, `photo_file_size`, `job_title`, `employee_department_id`, `nationality_id`, `office_city`, `photo_file_name`, `photo_data`, `updated_at`, `employee_category_id`, `home_city`, `photo_content_type`, `gender`, `father_name`, `home_pin_code`, `office_state`, `home_phone`, `employee_number`, `status_description`, `children_count`, `husband_name`, `blood_group`, `office_pin_code`, `user_id`, `last_name`, `mother_name`, `fax`, `qualification`, `experience_detail`, `date_of_birth`, `home_country_id`, `office_address_line1`, `office_phone1`, `status`, `marital_status`, `home_address_line1`, `office_address_line2`, `office_country_id`, `office_phone2`, `first_name`, `middle_name`, `reporting_manager_id`, `home_address_line2`, `mobile_phone`, `email`) VALUES(3, 2, NULL, NULL, '2012-01-28', NULL, '2012-01-29 07:24:40', NULL, '', 2, 76, NULL, NULL, NULL, '2012-01-29 07:24:40', 2, NULL, NULL, 0, '', NULL, NULL, NULL, 'EMP6', NULL, NULL, '', '', NULL, 10, '1', '', NULL, '', '', '2002-01-28', NULL, NULL, NULL, 1, 'single', NULL, NULL, NULL, NULL, 'English Teacher', '', NULL, NULL, NULL, 'noreplyEMP6@fedena.com')
---
  def admission1
    @user = current_user
    @user_name = @user.username
    @employee1 = @user.employee_record
    @categories = EmployeeCategory.find(:all,:order => "name asc",:conditions => "status = true")
    @positions = []
    @grades = EmployeeGrade.find(:all,:order => "name asc",:conditions => "status = true")
    @departments = EmployeeDepartment.find(:all,:order => "name asc",:conditions => "status = true")
    @nationalities = Country.all
    @employee = Employee.new(params[:employee])
    @last_admitted_employee = Employee.find(:last,:conditions=>"employee_number != 'admin'")
    @config = Configuration.find_by_config_key('EmployeeNumberAutoIncrement')

    if request.post?

      unless params[:employee][:employee_number].to_i ==0
        @employee.employee_number= "E" + params[:employee][:employee_number].to_s
      end
      if @employee.save

SELECT * FROM `employee_leave_types`
---
        end


        @leave_type = EmployeeLeaveType.all

SELECT * FROM `employee_positions` WHERE (`employee_positions`.`employee_category_id` = '2')
---
        flash[:notice] = "#{t('flash15')} #{@employee.first_name} #{t('flash16')}"
        redirect_to :controller =>"employee" ,:action => "admission2", :id => @employee.id
      end
      @positions = EmployeePosition.find_all_by_employee_category_id(params[:employee][:employee_category_id])

SELECT * FROM `employee_categories` WHERE (`employee_categories`.`id` = 2)
SELECT * FROM `employee_positions` WHERE (status = 1) AND (`employee_positions`.`employee_category_id` = 2)
---
  def update_positions
    category = EmployeeCategory.find(params[:category_id])
    @positions = EmployeePosition.find_all_by_employee_category_id(category.id,:conditions=>'status = true')

SELECT * FROM `employees` WHERE (`employees`.`id` = 7)
UPDATE `employees` SET `home_phone` = '', `updated_at` = '2012-01-29 07:24:49', `office_city` = '', `office_state` = '', `fax` = '', `home_city` = '', `home_address_line2` = '', `office_phone2` = '', `office_country_id` = 76, `home_address_line1` = '', `mobile_phone` = '', `office_phone1` = '', `home_country_id` = 76, `office_address_line2` = '', `home_pin_code` = '', `office_address_line1` = '', `office_pin_code` = '', `home_state` = '' WHERE `id` = 7
SELECT `employees`.id FROM `employees` WHERE (`employees`.`employee_number` = BINARY 'EMP6' AND `employees`.id <> 7) LIMIT 1
---
  def admission2
    @countries = Country.find(:all)
    @employee = Employee.find(params[:id])
    if request.post? and @employee.update_attributes(params[:employee])
      sms_setting = SmsSetting.new()
      if sms_setting.application_sms_active and sms_setting.employee_sms_active
        recipient = ["#{@employee.mobile_phone}"]
        message = "#{t('joinning_info')} #{@employee.first_name}. #{t('username')}: #{@employee.employee_number}, #{t('password')}: #{@employee.employee_number}123. #{t('change_password_after_login')}"

SELECT * FROM `employees` WHERE (`employees`.`id` = 7)
SELECT * FROM `bank_fields` WHERE (status = true)
INSERT INTO `employee_bank_details` (`employee_id`, `bank_field_id`, `bank_info`) VALUES(7, 1, '')
---
  def admission3
    @employee = Employee.find(params[:id])
    @bank_fields = BankField.find(:all, :conditions=>"status = true")
    if @bank_fields.empty?
      redirect_to :action => "admission3_1", :id => @employee.id
    end
    if request.post?
      params[:employee_bank_details].each_pair do |k, v|
        EmployeeBankDetail.create(:employee_id => params[:id],
          :bank_field_id => k,:bank_info => v['bank_info'])

SELECT * FROM `employees` WHERE (`employees`.`id` = 7)
SELECT * FROM `additional_fields` WHERE (status = true)
INSERT INTO `employee_additional_details` (`additional_field_id`, `employee_id`, `additional_info`) VALUES(1, 7, '')
---
  def admission3_1
    @employee = Employee.find(params[:id])
    @additional_fields = AdditionalField.find(:all, :conditions=>"status = true")
    if @additional_fields.empty?
      redirect_to :action => "edit_privilege", :id => @employee.employee_number
    end
    if request.post?
      params[:employee_additional_details].each_pair do |k, v|
        EmployeeAdditionalDetail.create(:employee_id => params[:id],
          :additional_field_id => k,:additional_info => v['additional_info'])

SELECT * FROM `privileges` WHERE (`privileges`.`id` IN ('1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20'))
SELECT * FROM `users` WHERE (`users`.`username` = 'EMP6') LIMIT 1
SELECT * FROM `employees` WHERE (`employees`.user_id = 10) LIMIT 1
SELECT * FROM `privileges` INNER JOIN `privileges_users` ON `privileges`.id = `privileges_users`.privilege_id WHERE (`privileges_users`.user_id = 1 )
---
  def edit_privilege
    @privileges = Privilege.find(:all)
    @user = User.find_by_username(params[:id])
    @employee = @user.employee_record
    if request.post?
      new_privileges = params[:user][:privilege_ids] if params[:user]
      new_privileges ||= []
      @user.privileges = Privilege.find_all_by_id(new_privileges)

SELECT * FROM `employees` WHERE (`employees`.`id` = 7)
---
  def admission4
    @departments = EmployeeDepartment.find(:all)
    @categories  = EmployeeCategory.find(:all)
    @positions   = EmployeePosition.find(:all)
    @grades      = EmployeeGrade.find(:all)
    if request.post?
      @employee = Employee.find(params[:id])

SELECT * FROM `employees` WHERE (`employees`.`id` = 6)
---
  def change_reporting_manager
    @departments = EmployeeDepartment.find(:all)
    @categories  = EmployeeCategory.find(:all)
    @positions   = EmployeePosition.find(:all)
    @grades      = EmployeeGrade.find(:all)
    @emp = Employee.find(params[:id])

SELECT * FROM `employees` WHERE (`employees`.user_id = 1) LIMIT 1
SELECT * FROM `reminders` WHERE (is_read = false) AND (`reminders`.`recipient` = 1)
---
  def profile

    @current_user = current_user
    @employee = Employee.find(params[:id])
    @new_reminder_count = Reminder.find_all_by_recipient(@current_user.id, :conditions=>"is_read = false")

SELECT * FROM `employees` WHERE (`employees`.user_id = 2) LIMIT 1
SELECT * FROM `employee_attendances` WHERE (`employee_attendances`.`employee_id` = 2)
SELECT * FROM `employee_leave_types` WHERE (status = true)
SELECT `employee_leaves`.* FROM `employee_leaves` INNER JOIN `employee_leave_types` ON `employee_leave_types`.id = `employee_leaves`.employee_leave_type_id WHERE (status = true) AND (`employee_leaves`.`employee_id` = 2)
---
  def view_attendance
    @employee = Employee.find(params[:id])
    @attendance_report = EmployeeAttendance.find_all_by_employee_id(@employee.id)
    @leave_types = EmployeeLeaveType.find(:all, :conditions => "status = true")
    @leave_count = EmployeeLeave.find_all_by_employee_id(@employee,:joins=>:employee_leave_type,:conditions=>"status = true")

SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
SELECT * FROM `subjects` WHERE (is_deleted=false) AND (`subjects`.`batch_id` = 1)
---
  def update_subjects
    batch = Batch.find(params[:batch_id])
    @subjects = Subject.find_all_by_batch_id(batch.id,:conditions=>"is_deleted=false")

SELECT * FROM `subjects` WHERE (`subjects`.`id` = 1)
SELECT * FROM `employees_subjects` WHERE (`employees_subjects`.`subject_id` = 1)
SELECT * FROM `employee_departments` WHERE (`employee_departments`.`status` = 1)
---
  def select_department
    @subject = Subject.find(params[:subject_id])
    @assigned_employee = EmployeesSubject.find_all_by_subject_id(@subject.id)
    @departments = EmployeeDepartment.find(:all, :conditions =>{:status=>true})

SELECT * FROM `subjects` WHERE (`subjects`.`id` = 1)
SELECT * FROM `employees` WHERE (`employees`.`status` = 1) AND (`employees`.`employee_department_id` = '2')
---
  def update_employees
    @subject = Subject.find(params[:subject_id])
    @employees = Employee.find_all_by_employee_department_id(params[:department_id], :conditions =>{:status=>true})

SELECT * FROM `employee_departments` WHERE (`employee_departments`.`status` = 1)
SELECT * FROM `subjects` WHERE (`subjects`.`id` = 1)
SELECT * FROM `employees` WHERE (`employees`.`employee_department_id` = 2)
INSERT INTO `employees_subjects` (`employee_id`, `subject_id`) VALUES(7, 1)
SELECT * FROM `employees_subjects` WHERE (`employees_subjects`.`subject_id` = 1)
---
  def assign_employee
    @departments = EmployeeDepartment.find(:all,:conditions =>{:status=>true})
    @subject = Subject.find(params[:id1])
    @employees = Employee.find_all_by_employee_department_id(Employee.find(params[:id]).employee_department_id)
    EmployeesSubject.create(:employee_id => params[:id], :subject_id => params[:id1])
    @assigned_employee = EmployeesSubject.find_all_by_subject_id(@subject.id)