app/controllers/event_controller.rb

INSERT INTO `events` (`start_date`, `is_exam`, `created_at`, `title`, `is_common`, `origin_id`, `updated_at`, `is_holiday`, `description`, `end_date`, `is_due`, `origin_type`) VALUES('2012-02-01 06:58:00', 0, '2012-01-29 14:59:31', 'Mega Event', 1, NULL, '2012-01-29 14:59:31', 0, 'College is organizing mega event.', '2012-02-03 06:58:00', 0, NULL)
---
  def index
    @events = Event.new(params[:events])
    if params[:id].nil?
      @date = Time.now
    else
      date = params[:id].to_date
      @date = date.to_time
    end
    if request.post? and @events.save

SELECT * FROM `events` WHERE (`events`.`id` = 1)
SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `users`
INSERT INTO `reminders` (`is_deleted_by_recipient`, `created_at`, `body`, `sender`, `updated_at`, `is_read`, `recipient`, `subject`, `is_deleted_by_sender`) VALUES(0, '2012-01-29 14:59:38', 'New event description : College is organizing mega event. Start Date : 01/02/2012 06:58 AM End Date : 03/02/2012 06:58 AM', 1, '2012-01-29 14:59:38', 0, 1, 'New Event : Mega Event', 0)
---
  def confirm_event
    event = Event.find(params[:id])
    if event.is_common == true
      if event.is_holiday == true
        @pe = PeriodEntry.find(:all, :conditions=>"month_date BETWEEN '" + event.start_date.strftime("%Y-%m-%d") + "' AND '" +  event.end_date.strftime("%Y-%m-%d") +"'")
        unless @pe.nil?
          @pe.each do |p|
            p.delete
          end
        end
      end
      @users = User.find(:all)
      @users.each do |u|
        Reminder.create(:sender=> current_user.id,:recipient=>u.id,
          :subject=>"#{t('new_event')} : #{event.title}",
          :body=>"#{t('event_description')} : #{event.description} <br/> #{t('start_date')} : " + event.start_date.strftime("%d/%m/%Y %I:%M %p") + " <br/> #{t('end_date')} : " + event.end_date.strftime("%d/%m/%Y %I:%M %p"))