app/controllers/exam_controller.rb

  def update_batch
    @batch = Batch.find_all_by_course_id(params[:course_name], :conditions => { :is_deleted => false, :is_active => true })
---
SELECT * FROM `batches` WHERE (`batches`.`is_deleted` = 0 AND `batches`.`is_active` = 1) AND (`batches`.`course_id` = '1')