app/controllers/news_controller.rb

INSERT INTO `news` (`created_at`, `title`, `updated_at`, `content`, `author_id`) VALUES('2012-01-29 06:10:53', 'TELM is getting launched in HBS on 1/02/2012', '2012-01-29 06:10:53', '<p>&nbsp;Dear Students,</p>\r\n<p>&nbsp;</p>\r\n<p>We are implementing TELM in our college from 01/02/2012.</p>\r\n<p>&nbsp;</p>\r\n<p>Regards,</p>\r\n<p>Administration</p>', 1)
---
  def add
    @news = News.new(params[:news])
    @news.author = current_user
    if request.post? and @news.save

SELECT * FROM `news` ORDER BY created_at DESC LIMIT 0, 12
---
  def all
    @news = News.paginate :page => params[:page]

SELECT * FROM `news` WHERE (`news`.`id` = 1) ORDER BY created_at DESC
---
  def view
    @current_user = current_user
    @news = News.find(params[:id])