app/controllers/payroll_controller.rb

SELECT * FROM `payroll_categories` WHERE (`payroll_categories`.`is_deduction` = 0) ORDER BY name ASC
---
  def add_category
    @categories = PayrollCategory.find_all_by_is_deduction(false, :order=> "name ASC")

SELECT * FROM `employees` WHERE (`employees`.`id` = 7)
SELECT * FROM `payroll_categories` WHERE (`payroll_categories`.`status` = 1 AND `payroll_categories`.`payroll_category_id` IS NULL)
SELECT * FROM `employee_salary_structures` WHERE (`employee_salary_structures`.`employee_id` = 7)
INSERT INTO `employee_salary_structures` (`payroll_category_id`, `amount`, `employee_id`) VALUES(6, '', 7)
---
  def manage_payroll
    @employee = Employee.find(params[:id])
    @independent_categories = PayrollCategory.find_all_by_payroll_category_id_and_status(nil, true)
    @dependent_categories = PayrollCategory.find_all_by_status(true, :conditions=>"payroll_category_id not null")
    payroll_created = EmployeeSalaryStructure.find_all_by_employee_id(@employee.id)
    unless @independent_categories.empty? and @dependent_categories.empty?
      if payroll_created.empty?
        if request.post?

          params[:manage_payroll].each_pair do |k, v|
            EmployeeSalaryStructure.create(:employee_id => params[:id], :payroll_category_id => k, :amount => v['amount'])