app/controllers/reminder_controller.rb

  def index
    @user = current_user
    @reminders = Reminder.paginate(:page => params[:page], :conditions=>["recipient = '#{@user.id}' and is_deleted_by_recipient = false"], :order=>"created_at DESC")
---
SELECT * FROM `reminders` WHERE (is_read = true and is_deleted_by_recipient = false) AND (`reminders`.`recipient` = 2) ORDER BY created_at DESC

  def create_reminder
    @user = current_user
    @departments = EmployeeDepartment.find(:all)
    @new_reminder_count = Reminder.find_all_by_recipient(@user.id, :conditions=>"is_read = false")
    unless params[:send_to].nil?
    recipients_array = params[:send_to].split(",").collect{ |s| s.to_i }
    @recipients = User.find(recipients_array)
    end
    if request.post?
      unless params[:reminder][:body] == "" or params[:recipients] == ""
        recipients_array = params[:recipients].split(",").collect{ |s| s.to_i }
        recipients_array.each do |r|
          user = User.find(r)
          Reminder.create(:sender => @user.id, :recipient => user.id, :subject=>params[:reminder][:subject],
            :body=>params[:reminder][:body], :is_read=>false, :is_deleted_by_sender=>false,:is_deleted_by_recipient=>false)
---
SELECT * FROM `employee_departments` WHERE (status = true)
SELECT * FROM `reminders` WHERE (is_read = false) AND (`reminders`.`recipient` = 2)
SELECT * FROM `employee_departments`
SELECT * FROM `users` WHERE (`users`.`id` = 2)
INSERT INTO `reminders` (`is_deleted_by_recipient`, `created_at`, `body`, `sender`, `updated_at`, `is_read`, `recipient`, `subject`, `is_deleted_by_sender`) VALUES(0, '2012-01-29 14:56:59', 'Hi Sowjanya,\r\n\r\nIt\'s chilling here.', 2, '2012-01-29 14:56:59', 0, 9, 'It\'s chilling here', 0)

  def to_employees
    if params[:dept_id] == ""
      render :update do |page|
        page.replace_html "to_employees", :text => ""
      end
      return
    end
    department = EmployeeDepartment.find(params[:dept_id])
    employees = department.employees
    @to_users = employees.map { |s| s.user.id unless s.user.nil? }
---
SELECT * FROM `employee_departments` WHERE (`employee_departments`.`id` = 2)
SELECT * FROM `employees` WHERE (`employees`.employee_department_id = 2)
SELECT * FROM `users` WHERE (`users`.`id` = 2)

  def to_students
    if params[:batch_id] == ""
      render :update do |page|
        page.replace_html "to_user", :text => ""
      end
      return
    end

    batch = Batch.find(params[:batch_id])
    students = batch.students
    @to_users = students.map { |s| s.user.id unless s.user.nil? }
---
SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
SELECT * FROM `students` WHERE (`students`.batch_id = 1)
SELECT * FROM `users` WHERE (`users`.`id` = 2)

  def update_recipient_list
    if params[:recipients]
    recipients_array = params[:recipients].split(",").collect{ |s| s.to_i }
    @recipients = User.find(recipients_array)
---
SELECT * FROM `users` WHERE (`users`.`id` = 2)

  def sent_reminder
    @user = current_user
    @sent_reminders = Reminder.paginate(:page => params[:page], :conditions=>["sender = '#{@user.id}' and is_deleted_by_sender = false"],  :order=>"created_at DESC")
    @new_reminder_count = Reminder.find_all_by_recipient(@user.id, :conditions=>"is_read = false")
---
SELECT * FROM `reminders` WHERE (sender = '2' and is_deleted_by_sender = false) ORDER BY created_at DESC LIMIT 0, 12
SELECT * FROM `reminders` WHERE (is_read = false) AND (`reminders`.`recipient` = 2)

  def view_reminder
    user = current_user
    @new_reminder = Reminder.find(params[:id2])
    Reminder.update(@new_reminder.id, :is_read => true)
---
SELECT * FROM `reminders` WHERE (`reminders`.`id` = 2)
UPDATE `reminders` SET `updated_at` = '2012-01-29 15:46:44', `is_read` = 1 WHERE `id` = 2

  def mark_unread
    @reminder = Reminder.find(params[:id2])
    Reminder.update(@reminder.id, :is_read => false)
---
SELECT * FROM `reminders` WHERE (`reminders`.`id` = 2)
UPDATE `reminders` SET `updated_at` = '2012-01-29 15:46:52', `is_read` = 0 WHERE `id` = 2