app/controllers/student_controller.rb

SELECT * FROM `sms_settings` WHERE (`sms_settings`.`settings_key` = 'ApplicationEnabled') LIMIT 1
SELECT * FROM `configurations` WHERE (`configurations`.`config_key` = 'AvailableModules')
SELECT `students`.id FROM `students` WHERE (`students`.`admission_no` = BINARY '0001') LIMIT 1
INSERT INTO `students` (`city`, `pin_code`, `created_at`, `photo_file_size`, `student_category_id`, `admission_no`, `nationality_id`, `immediate_contact_id`, `photo_file_name`, `photo_data`, `updated_at`, `batch_id`, `language`, `country_id`, `photo_content_type`, `gender`, `phone1`, `admission_date`, `blood_group`, `phone2`, `status_description`, `is_deleted`, `user_id`, `last_name`, `is_active`, `has_paid_fees`, `date_of_birth`, `religion`, `is_sms_enabled`, `birth_place`, `address_line1`, `class_roll_no`, `first_name`, `middle_name`, `address_line2`, `state`, `email`) VALUES('', '', '2012-01-29 06:48:52', 18527, 1, '0001', 76, NULL, 'Red-eyed treefrog.jpg', NULL, '2012-01-29 06:48:52', 1, 'Telugu', 76, 'image/jpeg', 'f', '', '2012-01-28', 'O+', '', NULL, 0, 9, ' Kolli', 1, 0, '2007-01-28', '', 1, 'Hyderabad', '', NULL, 'Sowjanya', '', '', '', 'noreply0001@fedena.com')
SELECT * FROM `students` ORDER BY students.id DESC LIMIT 1
---
  def admission1
    @student = Student.new(params[:student])
    @application_sms_enabled = SmsSetting.find_by_settings_key("ApplicationEnabled")
    @last_admitted_student = Student.find(:last)
    @config = Configuration.find_by_config_key('AdmissionNumberAutoIncrement')
    @categories = StudentCategory.active
    if request.post?
      if @config.config_value.to_i == 1
        @exist = Student.find_by_admission_no(params[:student][:admission_no])
        if @exist.nil?
          @status = @student.save
        else
          @last_admitted_student = Student.find(:last)
          @student.admission_no = @last_admitted_student.admission_no.next
          @status = @student.save
        end
      else
        @status = @student.save
      end
      if @status
        sms_setting = SmsSetting.new()
        if sms_setting.application_sms_active and @student.is_sms_enabled
          recipients = []
          message = "#{t('student_admission_done')} #{@student.admission_no} #{t('password_is')} #{@student.admission_no}123"
          if sms_setting.student_sms_active
            recipients.push @student.phone2 unless @student.phone2.blank?

SELECT * FROM `students` WHERE (`students`.`id` = 1)
SELECT `guardians`.* FROM `guardians` WHERE (`guardians`.ward_id = 1)
INSERT INTO `guardians` (`city`, `occupation`, `dob`, `created_at`, `updated_at`, `relation`, `country_id`, `last_name`, `income`, `office_phone1`, `office_address_line1`, `office_phone2`, `office_address_line2`, `ward_id`, `first_name`, `email`, `mobile_phone`, `state`, `education`) VALUES('', '', '1964-01-21', '2012-01-29 06:49:39', '2012-01-29 06:49:39', 'Father', 76, 'Kolli', '', '', '', '', '', 1, 'Sambaiah', '', '', '', '')
---
  def admission2
    @student = Student.find params[:id], :include => [:guardians]
    @guardian = Guardian.new params[:guardian]
    if request.post? and @guardian.save

SELECT * FROM `students` WHERE (`students`.`batch_id` = '1') ORDER BY first_name ASC
---
  def list_students_by_course
    @students = Student.find_all_by_batch_id(params[:batch_id], :order => 'first_name ASC')

SELECT * FROM `student_additional_fields` WHERE (status = true)
SELECT * FROM `student_previous_datas` WHERE (`student_previous_datas`.`student_id` = 1) LIMIT 1
SELECT * FROM `students` WHERE (`students`.`id` = 1)
---
  def profile
    @current_user = current_user
    @address = @student.address_line1.to_s + ' ' + @student.address_line2.to_s
    @additional_fields = StudentAdditionalField.all(:conditions=>"status = true")
    @sms_module = Configuration.available_modules
    @sms_setting = SmsSetting.new
    @previous_data = StudentPreviousData.find_by_student_id(@student.id)
    @immediate_contact = Guardian.find(@student.immediate_contact_id) \
      unless @student.immediate_contact_id.nil? or @student.immediate_contact_id == ''

SELECT * FROM `batches`
---
  def advanced_search
    @batches = Batch.all

SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
SELECT * FROM `subjects` WHERE (`subjects`.`id` = 3)
SELECT * FROM `elective_groups` WHERE (`elective_groups`.`id` = 1)
---
  def electives
    @batch = Batch.find(params[:id])
    @elective_subject = Subject.find(params[:id2])
    @students = @batch.students
    @elective_group = ElectiveGroup.find(@elective_subject.elective_group_id)

SELECT * FROM `students` WHERE (`students`.`id` = 1)
INSERT INTO `students_subjects` (`student_id`, `batch_id`, `subject_id`) VALUES(1, 1, 3)
SELECT * FROM `subjects` WHERE (`subjects`.`id` = 3)
---
  def assign_students
    @student = Student.find(params[:id])
    StudentsSubject.create(:student_id=>params[:id],:subject_id=>params[:id2],:batch_id=>@student.batch_id)
    @student = Student.find(params[:id])

SELECT * FROM `students` WHERE (`students`.batch_id = 1)
---
  def find_student
    @student = Student.find params[:id]