app/controllers/user_controller.rb

  def all
    @users = User.all
---
SELECT * FROM `users`

  def list_user
    if params[:user_type] == 'Admin'
      @users = User.find(:all, :conditions => {:admin => true}, :order => 'first_name ASC')
      render(:update) do |page|
        page.replace_html 'users', :partial=> 'users'
        page.replace_html 'employee_user', :text => ''
        page.replace_html 'student_user', :text => ''
      end
    elsif params[:user_type] == 'Employee'
      render(:update) do |page|
        hr = Configuration.find_by_config_value("HR")
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `configurations` WHERE (`configurations`.`config_value` = 'HR') LIMIT 1

  def list_employee_user
    emp_dept = params[:dept_id]
    @employee = Employee.find_all_by_employee_department_id(emp_dept, :order =>'first_name ASC')
    @users = @employee.collect { |employee| employee.user}
---
SELECT * FROM `employees` WHERE (`employees`.`employee_department_id` = '1') ORDER BY first_name ASC
SELECT * FROM `users` WHERE (`users`.`id` = 1)

  def user_change_password
    user = User.find_by_username(params[:id])

    if request.post?
      if params[:user][:new_password]=='' and params[:user][:confirm_password]==''
        flash[:warn_notice]= "<p>#{t('flash6')}</p>"
      else
        if params[:user][:new_password] == params[:user][:confirm_password]
          user.password = params[:user][:new_password]
          user.update_attributes(:password => user.password,
            :role => user.role_name
          )
---
SELECT `users`.id FROM `users` WHERE (`users`.`username` = BINARY 'EMP1' AND `users`.id <> 2) LIMIT 1
UPDATE `users` SET `updated_at` = '2012-01-29 14:55:21', `hashed_password` = 'a1bef399774f34faefec700e1806f1c73fad05ff' WHERE `id` = 2

  def dashboard
    @user = current_user
    @config = Configuration.available_modules
    @employee = @user.employee_record if ['employee','admin'].include?(@user.role_name.downcase)
---
SELECT * FROM `employees` WHERE (`employees`.user_id = 1) LIMIT 1

  def edit
    @user = User.find_by_username(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`username` = 'EMP1') LIMIT 1

  def forgot_password
    #    flash[:notice]="You do not have permission to access forgot password!"
    #    redirect_to :action=>"login"
    @network_state = Configuration.find_by_config_key("NetworkState")
    if request.post? and params[:reset_password]
      if user = User.find_by_username(params[:reset_password][:username])
        user.reset_password_code = Digest::SHA1.hexdigest( "#{user.email}#{Time.now.to_s.split(//).sort_by {rand}.join}" )
        user.reset_password_code_until = 1.day.from_now
        user.role = user.role_name
        user.save(false)
---
SELECT * FROM `configurations` WHERE (`configurations`.`config_key` = 'Locale') LIMIT 1
SELECT * FROM `users` WHERE (`users`.`username` = 'e1') LIMIT 1
UPDATE `users` SET `updated_at` = '2012-01-29 06:34:53', `reset_password_code` = 'fa6dcda5ee3a02d5b1e1d0c1fa6a4dde087e8608', `reset_password_code_until` = '2012-01-30 06:34:53' WHERE `id` = 2

  def login
    @institute = Configuration.find_by_config_key("LogoName")
    if request.post? and params[:user]
      @user = User.new(params[:user])
      user = User.find_by_username @user.username
---
SELECT * FROM `configurations` WHERE (`configurations`.`config_key` = 'AvailableModules')
SELECT `users`.id FROM `users` WHERE (`users`.`username` = BINARY 'admin') LIMIT 1

  def profile
    @config = Configuration.available_modules
    @current_user = current_user
    @username = @current_user.username if session[:user_id]
    @user = User.find_by_username(params[:id])
    unless @user.nil?
      @employee = Employee.find_by_employee_number(@user.username)
      @student = Student.find_by_admission_no(@user.username)
---
SELECT * FROM `users` WHERE (`users`.`username` = 'EMP1') LIMIT 1
SELECT * FROM `employees` WHERE (`employees`.`employee_number` = 'EMP1') LIMIT 1
SELECT * FROM `students` WHERE (`students`.`admission_no` = 'EMP1') LIMIT 1